In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:easwari@localhost

In [3]:
%%sql
use window_functions;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost
22 rows affected.

[('amazon_adobe',),
 ('electronics_sales',),
 ('employees',),
 ('employees2',),
 ('employees3',),
 ('employees4',),
 ('items',),
 ('netflix_dataset',),
 ('netflix_review',),
 ('npv',),
 ('orders',),
 ('orders2',),
 ('payments',),
 ('product_name',),
 ('product_price',),
 ('productdelivery',),
 ('products',),
 ('products2',),
 ('queries',),
 ('rides',),
 ('students',),
 ('trip',)]

In [5]:
%%sql
select * from employees2;

 * mysql+pymysql://root:***@localhost
8 rows affected.

[(1, 'Sanjay', None, 50000, 'Chennai'),
 (2, 'Janani', 1, 45000, 'Bangalore'),
 (3, 'Bairo', 1, 55000, 'Chennai'),
 (4, 'Kutty', 2, 40000, 'Bangalore'),
 (5, 'Shiva', 1, 60000, 'Mumbai'),
 (6, 'Ganesh', 1, 48000, 'Chennai'),
 (7, 'Rohitha', 2, 52000, 'Bangalore'),
 (8, 'Sheela', 1, 58000, 'Mumbai')]

--> stored procedure without parameter

--> create a stored procedure to get employees details from employees2 table

--> we can call the stored procedure using {call} keyword followed by {stored procedure name}

In [7]:
%%sql

CREATE PROCEDURE get_employees()
BEGIN
    SELECT * FROM employees;
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [9]:
%%sql
call get_employees;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'Lavanya', 'HR', 50000),
 (2, 'Jaanu', 'Finance', 60000),
 (3, 'Lakshith', 'HR', 45000),
 (4, 'Darshith', 'Finance', 55000),
 (5, 'Priya', 'IT', 70000),
 (6, 'Keerthana', 'IT', 72000),
 (7, 'Janani', 'HR', 47000),
 (8, 'Rohitha', 'Finance', 64000),
 (9, 'Varsha', 'IT', 69000),
 (10, 'Kavya', 'IT', 72000)]

--> stored procedure with parameter

--> create a stored procedure to get employees details from employees2 table and we can pass employee name as argument

In [10]:
%%sql

CREATE PROCEDURE get_employees2(IN p_name varchar(50))
BEGIN
    SELECT id,name,department,salary 
    FROM employees
    WHERE name = p_name;
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [11]:
%%sql
call get_employees2("Lavanya");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(1, 'Lavanya', 'HR', 50000)]

In [12]:
%%sql
call get_employees2("Rohitha");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(8, 'Rohitha', 'Finance', 64000)]

--> stored procedure with 2 parameters

In [17]:
%%sql

CREATE PROCEDURE get_employees3(IN p_name varchar(50), IN p_department varchar(50))
BEGIN
    SELECT id,name,department,salary 
    FROM employees
    WHERE name = p_name AND department = p_department;
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [18]:
%%sql
call get_employees3("Lavanya","HR");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(1, 'Lavanya', 'HR', 50000)]